
{
    "title": "Opening System के महत्वपूर्ण प्रश्न और उत्तर",
    "content":
[
    {
        "heading": "<b>1.</b> ऑपरेटिंग सिस्टम क्या है?",
        "description": "ऑपरेटिंग सिस्टम एक सॉफ्टवेयर है,<br> जो हार्डवेयर और यूजर के बीच इंटरफेस प्रदान करता है।"
    },
    {
        "heading": "<b>2.</b> ऑपरेटिंग सिस्टम के मुख्य कार्य क्या हैं?",
        "description": "ऑपरेटिंग सिस्टम मेमोरी प्रबंधन, प्रोसेस मैनेजमेंट,<br> फाइल मैनेजमेंट और इनपुट/आउटपुट कंट्रोल का कार्य करता है।"
    },
    {
        "heading": "<b>3.</b> कितने प्रकार के ऑपरेटिंग सिस्टम होते हैं?",
        "description": "**मुख्य प्रकार:**<br> 1. Single-User OS<br> 2. Multi-User OS<br> 3. Real-Time OS<br> 4. Distributed OS<br> 5. Network OS<br> 6. Mobile OS"
    },
    {
        "heading": "<b>4.</b> Single-User और Multi-User OS में क्या अंतर है?",
        "description": "**Single-User OS** में एक समय में एक ही यूजर काम कर सकता है,<br> जबकि **Multi-User OS** कई यूजर्स को एक साथ काम करने की अनुमति देता है।"
    },
    {
        "heading": "<b>5.</b> Windows और Linux में क्या अंतर है?",
        "description": "**Windows** एक पेड और यूजर-फ्रेंडली OS है,<br> जबकि **Linux** एक ओपन-सोर्स और अधिक सुरक्षित OS है।"
    },
    {
        "heading": "<b>6.</b> Real-Time Operating System (RTOS) क्या है?",
        "description": "RTOS एक ऐसा ऑपरेटिंग सिस्टम है,<br> जो निश्चित समय में डेटा प्रोसेस करता है,<br> जैसे एयर ट्रैफिक कंट्रोल सिस्टम।"
    },
    {
        "heading": "<b>7.</b> Kernel क्या होता है?",
        "description": "Kernel ऑपरेटिंग सिस्टम का मुख्य भाग होता है,<br> जो हार्डवेयर और सॉफ्टवेयर के बीच संचार करता है।"
    },
    {
        "heading": "<b>8.</b> Booting क्या होती है?",
        "description": "Booting वह प्रक्रिया है,<br> जिसमें कंप्यूटर को स्टार्ट किया जाता है और OS लोड होता है।"
    },
    {
        "heading": "<b>9.</b> Warm Booting और Cold Booting में क्या अंतर है?",
        "description": "**Warm Booting** में कंप्यूटर को Restart किया जाता है,<br> जबकि **Cold Booting** में कंप्यूटर को पूरी तरह से बंद कर फिर चालू किया जाता है।"
    },
    {
        "heading": "<b>10.</b> Process और Thread में क्या अंतर है?",
        "description": "**Process** एक प्रोग्राम का Execution होता है,<br> जबकि **Thread** एक Process का हिस्सा होता है,<br> जो एक कार्य को हैंडल करता है।"
    },
    {
        "heading": "<b>11.</b> Deadlock क्या होता है?",
        "description": "Deadlock वह स्थिति होती है,<br> जब दो या अधिक प्रोसेस एक-दूसरे के संसाधनों की प्रतीक्षा करते रहते हैं,<br> और कोई भी आगे नहीं बढ़ सकता।"
    },
    {
        "heading": "<b>12.</b> Paging और Segmentation में क्या अंतर है?",
        "description": "**Paging** में मेमोरी को फिक्स साइज के ब्लॉक में बांटा जाता है,<br> जबकि **Segmentation** में मेमोरी को लॉजिकल यूनिट में विभाजित किया जाता है।"
    },
    {
        "heading": "<b>13.</b> Virtual Memory क्या होती है?",
        "description": "Virtual Memory एक तकनीक है,<br> जो हार्ड डिस्क के हिस्से को RAM की तरह उपयोग करती है।"
    },
    {
        "heading": "<b>14.</b> Cache Memory क्या होती है?",
        "description": "Cache Memory हाई-स्पीड मेमोरी होती है,<br> जो CPU और RAM के बीच डेटा को स्टोर करने के लिए उपयोग होती है।"
    },
    {
        "heading": "<b>15.</b> BIOS (Basic Input Output System) क्या है?",
        "description": "BIOS एक फर्मवेयर प्रोग्राम है,<br> जो कंप्यूटर के हार्डवेयर को चेक करके ऑपरेटिंग सिस्टम को लोड करता है।"
    },
    {
        "heading": "<b>16.</b> Open Source और Proprietary OS में क्या अंतर है?",
        "description": "**Open Source OS** का कोड सार्वजनिक रूप से उपलब्ध होता है,<br> जबकि **Proprietary OS** का कोड निजी कंपनियों के नियंत्रण में होता है।"
    },
    {
        "heading": "<b>17.</b> Command Line Interface (CLI) और Graphical User Interface (GUI) में क्या अंतर है?",
        "description": "**CLI** में कमांड लिखकर ऑपरेटिंग सिस्टम से इंटरैक्ट किया जाता है,<br> जबकि **GUI** में माउस और ग्राफिकल आइकॉन का उपयोग होता है।"
    },
    {
        "heading": "<b>18.</b> Swap Memory क्या होती है?",
        "description": "Swap Memory हार्ड डिस्क का वह भाग होता है,<br> जिसे अस्थायी रूप से RAM की तरह उपयोग किया जाता है।"
    },
    {
        "heading": "<b>19.</b> Task Manager क्या होता है?",
        "description": "Task Manager एक टूल है,<br> जो रनिंग प्रोसेस, CPU और मेमोरी उपयोग को मॉनिटर करता है।"
    },
    {
        "heading": "<b>20.</b> Linux में सबसे ज्यादा उपयोग होने वाले Command कौन-से हैं?",
        "description": "कुछ महत्वपूर्ण Linux Commands:<br> 1. **ls** - फाइल लिस्ट दिखाने के लिए<br> 2. **cd** - डायरेक्टरी बदलने के लिए<br> 3. **pwd** - वर्तमान डायरेक्टरी दिखाने के लिए<br> 4. **rm** - फाइल डिलीट करने के लिए<br> 5. **mkdir** - नई डायरेक्टरी बनाने के लिए"
    },
    
    
    {
        "heading": "<b>21.</b> मल्टीटास्किंग क्या होती है?",
        "description": "मल्टीटास्किंग एक ऐसी प्रक्रिया है,<br> जिसमें ऑपरेटिंग सिस्टम एक ही समय में कई टास्क (प्रोसेस) को संभालता है।"
    },
    {
        "heading": "<b>22.</b> Multiprocessing और Multithreading में क्या अंतर है?",
        "description": "**Multiprocessing** में एक से अधिक CPU का उपयोग किया जाता है,<br> जबकि **Multithreading** में एक ही प्रोसेस के अंदर कई थ्रेड्स काम कर सकते हैं।"
    },
    {
        "heading": "<b>23.</b> Distributed Operating System क्या है?",
        "description": "Distributed OS कई कंप्यूटरों को जोड़कर एक ही सिस्टम की तरह काम करता है,<br> जिससे संसाधनों को शेयर किया जा सकता है।"
    },
    {
        "heading": "<b>24.</b> Network Operating System (NOS) क्या होता है?",
        "description": "NOS एक ऑपरेटिंग सिस्टम होता है,<br> जो नेटवर्क पर आधारित डिवाइस को मैनेज करता है,<br> जैसे Windows Server, Linux Server आदि।"
    },
    {
        "heading": "<b>25.</b> Device Driver क्या होता है?",
        "description": "Device Driver एक सॉफ्टवेयर प्रोग्राम होता है,<br> जो ऑपरेटिंग सिस्टम और हार्डवेयर डिवाइस के बीच संचार करता है।"
    },
    {
        "heading": "<b>26.</b> फ़ाइल सिस्टम (File System) क्या होता है?",
        "description": "फ़ाइल सिस्टम एक तरीका है,<br> जिससे डेटा को स्टोरेज डिवाइस पर व्यवस्थित और एक्सेस किया जाता है,<br> जैसे FAT32, NTFS, ext4 आदि।"
    },
    {
        "heading": "<b>27.</b> Paging और Fragmentation में क्या अंतर है?",
        "description": "**Paging** में मेमोरी को समान आकार के ब्लॉक्स में विभाजित किया जाता है,<br> जबकि **Fragmentation** में असमान ब्लॉक्स के कारण स्टोरेज बर्बाद हो सकता है।"
    },
    {
        "heading": "<b>28.</b> Thrashing क्या होता है?",
        "description": "Thrashing वह स्थिति होती है,<br> जब CPU लगातार पेज स्वैपिंग में व्यस्त रहता है और वास्तविक कार्य नहीं कर पाता।"
    },
    {
        "heading": "<b>29.</b> Linux और Unix में क्या अंतर है?",
        "description": "**Linux** एक ओपन-सोर्स OS है,<br> जबकि **Unix** एक प्रोपाइटरी (Proprietary) OS है,<br> जिसे AT&T Bell Labs ने विकसित किया था।"
    },
    {
        "heading": "<b>30.</b> OSI मॉडल क्या होता है?",
        "description": "OSI (Open Systems Interconnection) मॉडल 7-लेयर नेटवर्क आर्किटेक्चर है,<br> जो डेटा ट्रांसमिशन को व्यवस्थित करता है।"
    },
    {
        "heading": "<b>31.</b> Windows Safe Mode क्या होता है?",
        "description": "Windows Safe Mode एक विशेष मोड है,<br> जिसमें केवल आवश्यक सिस्टम फाइल और ड्राइवर लोड होते हैं,<br> जिससे समस्याओं का समाधान किया जा सकता है।"
    },
    {
        "heading": "<b>32.</b> NTFS और FAT32 में क्या अंतर है?",
        "description": "**NTFS** अधिक सुरक्षित और तेज़ फ़ाइल सिस्टम है,<br> जबकि **FAT32** अधिक पुराना और सीमित क्षमता वाला फ़ाइल सिस्टम है।"
    },
    {
        "heading": "<b>33.</b> Hypervisor क्या होता है?",
        "description": "Hypervisor एक सॉफ्टवेयर होता है,<br> जो वर्चुअल मशीन को बनाने और मैनेज करने के लिए उपयोग किया जाता है,<br> जैसे VMware, VirtualBox।"
    },
    {
        "heading": "<b>34.</b> System Call क्या होता है?",
        "description": "System Call वह इंटरफेस है,<br> जो यूजर प्रोग्राम को ऑपरेटिंग सिस्टम के साथ इंटरैक्ट करने की अनुमति देता है।"
    },
    {
        "heading": "<b>35.</b> लॉग फाइल (Log File) क्या होती है?",
        "description": "Log File एक फाइल होती है,<br> जिसमें सिस्टम एक्टिविटी, एरर, और इवेंट्स को रिकॉर्ड किया जाता है।"
    },
    {
        "heading": "<b>36.</b> BIOS और UEFI में क्या अंतर है?",
        "description": "**BIOS** एक पुराना फर्मवेयर इंटरफेस है,<br> जबकि **UEFI** अधिक आधुनिक और ग्राफिकल इंटरफेस प्रदान करता है।"
    },
    {
        "heading": "<b>37.</b> MacOS किन डिवाइसेस के लिए उपयोग होता है?",
        "description": "MacOS केवल Apple के Mac कंप्यूटरों के लिए डिज़ाइन किया गया ऑपरेटिंग सिस्टम है।"
    },
    {
        "heading": "<b>38.</b> Mobile OS क्या होता है?",
        "description": "Mobile OS वह ऑपरेटिंग सिस्टम होता है,<br> जो स्मार्टफोन और टैबलेट जैसे मोबाइल डिवाइसेस को नियंत्रित करता है,<br> जैसे Android, iOS।"
    },
    {
        "heading": "<b>39.</b> Task Scheduling क्या होता है?",
        "description": "Task Scheduling एक प्रक्रिया है,<br> जिसमें ऑपरेटिंग सिस्टम विभिन्न कार्यों को निष्पादित करने के लिए CPU को असाइन करता है।"
    },
    {
        "heading": "<b>40.</b> Daemon Process क्या होता है?",
        "description": "Daemon एक बैकग्राउंड प्रोसेस होता है,<br> जो ऑपरेटिंग सिस्टम में विभिन्न सेवाओं को मैनेज करता है,<br> जैसे HTTP Server, Database Server।"
    },
    
    {
        "heading": "<b>41.</b> साइबर सुरक्षा (Cyber Security) क्या है?",
        "description": "Cyber Security वह प्रक्रिया है,<br> जिसमें कंप्यूटर सिस्टम, नेटवर्क, और डेटा को साइबर हमलों से बचाया जाता है।"
    },
    {
        "heading": "<b>42.</b> फ़िशिंग (Phishing) क्या होता है?",
        "description": "Phishing एक साइबर अपराध है,<br> जिसमें नकली ईमेल या वेबसाइट के माध्यम से उपयोगकर्ता की संवेदनशील जानकारी चोरी की जाती है।"
    },
    {
        "heading": "<b>43.</b> रैनसमवेयर (Ransomware) क्या होता है?",
        "description": "Ransomware एक प्रकार का मैलवेयर है,<br> जो सिस्टम को लॉक कर देता है और डेटा को डिक्रिप्ट करने के लिए फिरौती मांगता है।"
    },
    {
        "heading": "<b>44.</b> वायरस और वर्म (Virus & Worm) में क्या अंतर है?",
        "description": "**Virus** एक मैलवेयर होता है,<br> जो किसी फाइल से जुड़कर फैलता है,<br> जबकि **Worm** खुद को स्वतः कॉपी करके नेटवर्क में फैलता है।"
    },
    {
        "heading": "<b>45.</b> मलवेयर (Malware) क्या होता है?",
        "description": "Malware एक हानिकारक सॉफ़्टवेयर होता है,<br> जो कंप्यूटर को नुकसान पहुंचाने या डेटा चोरी करने के लिए डिज़ाइन किया जाता है।"
    },
    {
        "heading": "<b>46.</b> फ़ायरवॉल (Firewall) क्या है?",
        "description": "Firewall एक सुरक्षा प्रणाली है,<br> जो अनधिकृत एक्सेस को रोकने के लिए नेटवर्क ट्रैफिक को फ़िल्टर करता है।"
    },
    {
        "heading": "<b>47.</b> स्पाईवेयर (Spyware) क्या होता है?",
        "description": "Spyware एक प्रकार का मैलवेयर है,<br> जो उपयोगकर्ता की गतिविधियों को ट्रैक करता है और संवेदनशील जानकारी चुराता है।"
    },
    {
        "heading": "<b>48.</b> दो-कारक प्रमाणीकरण (Two-Factor Authentication) क्या है?",
        "description": "Two-Factor Authentication (2FA) एक सुरक्षा प्रक्रिया है,<br> जिसमें लॉगिन करने के लिए पासवर्ड के साथ एक अतिरिक्त वेरिफिकेशन कोड की आवश्यकता होती है।"
    },
    {
        "heading": "<b>49.</b> Brute Force Attack क्या होता है?",
        "description": "Brute Force Attack एक साइबर हमला है,<br> जिसमें किसी अकाउंट का पासवर्ड आज़माने के लिए स्वचालित तरीके से कई संभावित पासवर्ड आजमाए जाते हैं।"
    },
    {
        "heading": "<b>50.</b> DDoS अटैक (DDoS Attack) क्या होता है?",
        "description": "DDoS (Distributed Denial of Service) Attack एक साइबर हमला है,<br> जिसमें किसी सर्वर या वेबसाइट पर अत्यधिक ट्रैफिक भेजकर उसे बंद कर दिया जाता है।"
    },
    {
        "heading": "<b>51.</b> End-to-End Encryption क्या होता है?",
        "description": "End-to-End Encryption एक सुरक्षा तकनीक है,<br> जिसमें केवल संदेश भेजने और प्राप्त करने वाले व्यक्ति ही डेटा को पढ़ सकते हैं।"
    },
    {
        "heading": "<b>52.</b> Public Key और Private Key में क्या अंतर है?",
        "description": "Public Key एक एन्क्रिप्शन कुंजी होती है,<br> जिसे सभी के साथ साझा किया जा सकता है,<br> जबकि Private Key केवल रिसीवर के पास होती है।"
    },
    {
        "heading": "<b>53.</b> Ethical Hacking क्या होता है?",
        "description": "Ethical Hacking कानूनी रूप से कंप्यूटर सिस्टम की सुरक्षा जाँच करने की प्रक्रिया है,<br> जिससे कमजोरियों को पहचाना और ठीक किया जा सके।"
    },
    {
        "heading": "<b>54.</b> VPN (Virtual Private Network) क्या होता है?",
        "description": "VPN एक तकनीक है,<br> जो इंटरनेट कनेक्शन को सुरक्षित बनाती है और उपयोगकर्ता की पहचान को छुपाती है।"
    },
    {
        "heading": "<b>55.</b> SQL Injection क्या होता है?",
        "description": "SQL Injection एक साइबर हमला है,<br> जिसमें मैलिशियस SQL क्वेरी डालकर डेटाबेस से संवेदनशील जानकारी निकाली जाती है।"
    },
    {
        "heading": "<b>56.</b> Zero-Day Attack क्या होता है?",
        "description": "Zero-Day Attack एक ऐसा साइबर हमला है,<br> जिसमें किसी सॉफ़्टवेयर की नई सुरक्षा खामी का फायदा उठाया जाता है,<br> जिसे अभी तक ठीक नहीं किया गया है।"
    },
    {
        "heading": "<b>57.</b> Cryptojacking क्या होता है?",
        "description": "Cryptojacking एक साइबर अपराध है,<br> जिसमें किसी उपयोगकर्ता के कंप्यूटर संसाधनों का उपयोग गुप्त रूप से क्रिप्टोकरेंसी माइनिंग के लिए किया जाता है।"
    },
    {
        "heading": "<b>58.</b> Social Engineering Attack क्या होता है?",
        "description": "Social Engineering Attack एक साइबर हमला है,<br> जिसमें उपयोगकर्ताओं को धोखा देकर उनकी संवेदनशील जानकारी प्राप्त की जाती है।"
    },
    {
        "heading": "<b>59.</b> IDS और IPS में क्या अंतर है?",
        "description": "**IDS (Intrusion Detection System)** केवल हमलों का पता लगाता है,<br> जबकि **IPS (Intrusion Prevention System)** हमलों को रोकने के लिए सक्रिय रूप से प्रतिक्रिया करता है।"
    },
    {
        "heading": "<b>60.</b> Data Breach क्या होता है?",
        "description": "Data Breach वह स्थिति होती है,<br> जब किसी संगठन की संवेदनशील जानकारी बिना अनुमति के सार्वजनिक हो जाती है।"
    }

    

]
}